Revit 2026 API

# HardwoodHardwoodFinish Property

---

The property labeled "Finish" from the "Hardwood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string HardwoodFinish { get; }
```
```vb
Public Shared ReadOnly Property HardwoodFinish As String
	Get
```
```cpp
public:
static property String^ HardwoodFinish {
	String^ get ();
}
```
```fsharp
static member HardwoodFinish : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodFinishType".

#### Reference

Hardwood Class

Autodesk.Revit.DB.Visual Namespace